XML/Request Entity.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ws="http://www.datanomic.com/ws">
  <soapenv:Header/>
  <soapenv:Body>
    <ws:request>
      <!--Optional:-->
      <ws:ListSubKey>?</ws:ListSubKey>
      <!--Optional:-->
      <ws:ListRecordType>?</ws:ListRecordType>
      <!--Optional:-->
      <ws:ListRecordOrigin>?</ws:ListRecordOrigin>
      <!--Optional:-->
      <ws:CustId>?</ws:CustId>
      <!--Optional:-->
      <ws:CustSubId>?</ws:CustSubId>
      <!--Optional:-->
      <ws:RegistrationNumber>?</ws:RegistrationNumber>
      <!--Optional:-->
      <ws:EntityName>?</ws:EntityName>
      <!--Optional:-->
      <ws:NameType>?</ws:NameType>
      <!--Optional:-->
      <ws:NameQuality>?</ws:NameQuality>
      <!--Optional:-->
      <ws:PrimaryName>?</ws:PrimaryName>
      <!--Optional:-->
      <ws:OriginalScriptName>?</ws:OriginalScriptName>
      <!--Optional:-->
      <ws:AliasIsAcronym>?</ws:AliasIsAcronym>
      <!--Optional:-->
      <ws:Address1>?</ws:Address1>
      <!--Optional:-->
      <ws:Address2>?</ws:Address2>
      <!--Optional:-->
      <ws:Address3>?</ws:Address3>
      <!--Optional:-->
      <ws:Address4>?</ws:Address4>
      <!--Optional:-->
      <ws:City>?</ws:City>
      <!--Optional:-->
      <ws:State>?</ws:State>
      <!--Optional:-->
      <ws:PostalCode>?</ws:PostalCode>
      <!--Optional:-->
      <ws:AddressCountryCode>?</ws:AddressCountryCode>
      <!--Optional:-->
      <ws:RegistrationCountryCode>?</ws:RegistrationCountryCode>
      <!--Optional:-->
      <ws:OperatingCountryCodes>?</ws:OperatingCountryCodes>
      <!--Optional:-->
      <ws:ProfileHyperlink>?</ws:ProfileHyperlink>
      <!--Optional:-->
      <ws:RiskScore>?</ws:RiskScore>
      <!--Optional:-->
      <ws:DataConfidenceScore>?</ws:DataConfidenceScore>
      <!--Optional:-->
      <ws:DataConfidenceComment>?</ws:DataConfidenceComment>
      <!--Optional:-->
      <ws:CustomString1>?</ws:CustomString1>
      <!--Optional:-->
      <ws:CustomString2>?</ws:CustomString2>
      <!--Optional:-->
      <ws:CustomString3>?</ws:CustomString3>
      <!--Optional:-->
      <ws:CustomString4>?</ws:CustomString4>
      <!--Optional:-->
      <ws:CustomString5>?</ws:CustomString5>
      <!--Optional:-->
      <ws:CustomString6>?</ws:CustomString6>
      <!--Optional:-->
      <ws:CustomString7>?</ws:CustomString7>
      <!--Optional:-->
      <ws:CustomString8>?</ws:CustomString8>
      <!--Optional:-->
      <ws:CustomString9>?</ws:CustomString9>
      <!--Optional:-->
      <ws:CustomString10>?</ws:CustomString10>
      <!--Optional:-->
      <ws:CustomString11>?</ws:CustomString11>
      <!--Optional:-->
      <ws:CustomString12>?</ws:CustomString12>
      <!--Optional:-->
      <ws:CustomString13>?</ws:CustomString13>
      <!--Optional:-->
      <ws:CustomString14>?</ws:CustomString14>
      <!--Optional:-->
      <ws:CustomString15>?</ws:CustomString15>
      <!--Optional:-->
      <ws:CustomString16>?</ws:CustomString16>
      <!--Optional:-->
      <ws:CustomString17>?</ws:CustomString17>
      <!--Optional:-->
      <ws:CustomString18>?</ws:CustomString18>
      <!--Optional:-->
      <ws:CustomString19>?</ws:CustomString19>
      <!--Optional:-->
      <ws:CustomString20>?</ws:CustomString20>
      <!--Optional:-->
      <ws:CustomString21>?</ws:CustomString21>
      <!--Optional:-->
      <ws:CustomString22>?</ws:CustomString22>
      <!--Optional:-->
      <ws:CustomString23>?</ws:CustomString23>
      <!--Optional:-->
      <ws:CustomString24>?</ws:CustomString24>
      <!--Optional:-->
      <ws:CustomString25>?</ws:CustomString25>
      <!--Optional:-->
      <ws:CustomString26>?</ws:CustomString26>
      <!--Optional:-->
      <ws:CustomString27>?</ws:CustomString27>
      <!--Optional:-->
      <ws:CustomString28>?</ws:CustomString28>
      <!--Optional:-->
      <ws:CustomString29>?</ws:CustomString29>
      <!--Optional:-->
      <ws:CustomString30>?</ws:CustomString30>
      <!--Optional:-->
      <ws:CustomString31>?</ws:CustomString31>
      <!--Optional:-->
      <ws:CustomString32>?</ws:CustomString32>
      <!--Optional:-->
      <ws:CustomString33>?</ws:CustomString33>
      <!--Optional:-->
      <ws:CustomString34>?</ws:CustomString34>
      <!--Optional:-->
      <ws:CustomString35>?</ws:CustomString35>
      <!--Optional:-->
      <ws:CustomString36>?</ws:CustomString36>
      <!--Optional:-->
      <ws:CustomString37>?</ws:CustomString37>
      <!--Optional:-->
      <ws:CustomString38>?</ws:CustomString38>
      <!--Optional:-->
      <ws:CustomString39>?</ws:CustomString39>
      <!--Optional:-->
      <ws:CustomString40>?</ws:CustomString40>
      <!--Optional:-->
      <ws:CustomDate1>?</ws:CustomDate1>
      <!--Optional:-->
      <ws:CustomDate2>?</ws:CustomDate2>
      <!--Optional:-->
      <ws:CustomDate3>?</ws:CustomDate3>
      <!--Optional:-->
      <ws:CustomDate4>?</ws:CustomDate4>
      <!--Optional:-->
      <ws:CustomDate5>?</ws:CustomDate5>
      <!--Optional:-->
      <ws:CustomNumber1>?</ws:CustomNumber1>
      <!--Optional:-->
      <ws:CustomNumber2>?</ws:CustomNumber2>
      <!--Optional:-->
      <ws:CustomNumber3>?</ws:CustomNumber3>
      <!--Optional:-->
      <ws:CustomNumber4>?</ws:CustomNumber4>
      <!--Optional:-->
      <ws:CustomNumber5>?</ws:CustomNumber5>
    </ws:request>
  </soapenv:Body>
</soapenv:Envelope>
